api/booking/examples/soap_request_booking.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:sch="http://www.bring.no/booking/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.bring.no/booking/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP-ENV:Body>
    <tns:bookingRequest xmlns:tns="http://www.bring.no/booking/" testIndicator="">
      <tns:consignment correlationId="">
        <tns:shippingDateTime/>
        <tns:parties>
          <tns:sender>
            <tns:name/>
            <tns:addressLine/>
            <tns:addressLine2/>
            <tns:postalCode/>
            <tns:city/>
            <tns:countryCode/>
            <tns:reference/>
            <tns:additionalAddressInfo/>
            <tns:contact>
              <tns:name/>
              <tns:email/>
              <tns:phoneNumber/>
            </tns:contact>
          </tns:sender>
          <tns:recipient>
            <tns:name/>
            <tns:addressLine/>
            <tns:addressLine2/>
            <tns:postalCode/>
            <tns:city/>
            <tns:countryCode/>
            <tns:reference/>
            <tns:additionalAddressInfo/>
            <tns:contact>
              <tns:name/>
              <tns:email/>
              <tns:phoneNumber/>
            </tns:contact>
          </tns:recipient>
          <tns:pickupPoint>
            <tns:id/>
            <tns:countryCode/>
          </tns:pickupPoint>
        </tns:parties>
        <tns:product>
          <tns:id/>
          <tns:customerNumber/>
          <tns:services>
            <tns:recipientNotification>
              <tns:email/>
              <tns:mobile/>
            </tns:recipientNotification>
            <tns:quickPackEnvelope/>
            <tns:cashOnDelivery>
              <tns:accountNumber/>
              <tns:accountType/>
              <tns:amount/>
              <tns:currencyCode/>
              <tns:message>
                <tns:value/>
                <tns:type/>
              </tns:message>
            </tns:cashOnDelivery>
            <tns:deliveryOption/>
            <tns:flexDelivery>
              <tns:message/>
            </tns:flexDelivery>
            <tns:deliveryIndoors>
              <tns:message/>
            </tns:deliveryIndoors>
            <tns:nonFreeze/>
            <tns:dangerousGoods>
              <tns:containerId/>
              <tns:weightInGrams/>
              <tns:unNumber/>
              <tns:commodity/>
              <tns:packingGroup/>
              <tns:dangerClass/>
              <tns:tunnelRestrictionCode/>
              <tns:safetyMarkCode/>
              <tns:factor/>
            </tns:dangerousGoods>
            <tns:express/>
            <tns:eveDelivery/>
            <tns:advisering/>
            <tns:simpleDelivery/>
          </tns:services>
          <tns:customsDeclaration>
            <tns:customsDeclarationType/>
            <tns:customsDeclarationText/>
          </tns:customsDeclaration>
        </tns:product>
        <tns:purchaseOrder/>
      </tns:consignment>
      <tns:consignment correlationId="">
        <tns:shippingDateTime/>
        <tns:parties>
          <tns:sender>
            <tns:name/>
            <tns:addressLine/>
            <tns:addressLine2/>
            <tns:postalCode/>
            <tns:city/>
            <tns:countryCode/>
            <tns:reference/>
            <tns:additionalAddressInfo/>
            <tns:contact>
              <tns:name/>
              <tns:email/>
              <tns:phoneNumber/>
            </tns:contact>
          </tns:sender>
          <tns:recipient>
            <tns:name/>
            <tns:addressLine/>
            <tns:addressLine2/>
            <tns:postalCode/>
            <tns:city/>
            <tns:countryCode/>
            <tns:reference/>
            <tns:additionalAddressInfo/>
            <tns:contact>
              <tns:name/>
              <tns:email/>
              <tns:phoneNumber/>
            </tns:contact>
          </tns:recipient>
          <tns:pickupPoint>
            <tns:id/>
            <tns:countryCode/>
          </tns:pickupPoint>
        </tns:parties>
        <tns:product>
          <tns:id/>
          <tns:customerNumber/>
          <tns:services>
            <tns:recipientNotification>
              <tns:email/>
              <tns:mobile/>
            </tns:recipientNotification>
            <tns:quickPackEnvelope/>
            <tns:cashOnDelivery>
              <tns:accountNumber/>
              <tns:accountType/>
              <tns:amount/>
              <tns:currencyCode/>
              <tns:message>
                <tns:value/>
                <tns:type/>
              </tns:message>
            </tns:cashOnDelivery>
            <tns:deliveryOption/>
            <tns:flexDelivery>
              <tns:message/>
            </tns:flexDelivery>
            <tns:deliveryIndoors>
              <tns:message/>
            </tns:deliveryIndoors>
            <tns:nonFreeze/>
            <tns:dangerousGoods>
              <tns:containerId/>
              <tns:weightInGrams/>
              <tns:unNumber/>
              <tns:commodity/>
              <tns:packingGroup/>
              <tns:dangerClass/>
              <tns:tunnelRestrictionCode/>
              <tns:safetyMarkCode/>
              <tns:factor/>
            </tns:dangerousGoods>
            <tns:express/>
            <tns:eveDelivery/>
            <tns:advisering/>
            <tns:simpleDelivery/>
          </tns:services>
          <tns:customsDeclaration>
            <tns:customsDeclarationType/>
            <tns:customsDeclarationText/>
          </tns:customsDeclaration>
        </tns:product>
        <tns:purchaseOrder/>
      </tns:consignment>
      <tns:consignment correlationId="">
        <tns:shippingDateTime/>
        <tns:parties>
          <tns:sender>
            <tns:name/>
            <tns:addressLine/>
            <tns:addressLine2/>
            <tns:postalCode/>
            <tns:city/>
            <tns:countryCode/>
            <tns:reference/>
            <tns:additionalAddressInfo/>
            <tns:contact>
              <tns:name/>
              <tns:email/>
              <tns:phoneNumber/>
            </tns:contact>
          </tns:sender>
          <tns:recipient>
            <tns:name/>
            <tns:addressLine/>
            <tns:addressLine2/>
            <tns:postalCode/>
            <tns:city/>
            <tns:countryCode/>
            <tns:reference/>
            <tns:additionalAddressInfo/>
            <tns:contact>
              <tns:name/>
              <tns:email/>
              <tns:phoneNumber/>
            </tns:contact>
          </tns:recipient>
          <tns:pickupPoint>
            <tns:id/>
            <tns:countryCode/>
          </tns:pickupPoint>
        </tns:parties>
        <tns:product>
          <tns:id/>
          <tns:customerNumber/>
          <tns:services>
            <tns:recipientNotification>
              <tns:email/>
              <tns:mobile/>
            </tns:recipientNotification>
            <tns:quickPackEnvelope/>
            <tns:cashOnDelivery>
              <tns:accountNumber/>
              <tns:accountType/>
              <tns:amount/>
              <tns:currencyCode/>
              <tns:message>
                <tns:value/>
                <tns:type/>
              </tns:message>
            </tns:cashOnDelivery>
            <tns:deliveryOption/>
            <tns:flexDelivery>
              <tns:message/>
            </tns:flexDelivery>
            <tns:deliveryIndoors>
              <tns:message/>
            </tns:deliveryIndoors>
            <tns:nonFreeze/>
            <tns:dangerousGoods>
              <tns:containerId/>
              <tns:weightInGrams/>
              <tns:unNumber/>
              <tns:commodity/>
              <tns:packingGroup/>
              <tns:dangerClass/>
              <tns:tunnelRestrictionCode/>
              <tns:safetyMarkCode/>
              <tns:factor/>
            </tns:dangerousGoods>
            <tns:express/>
            <tns:eveDelivery/>
            <tns:advisering/>
            <tns:simpleDelivery/>
          </tns:services>
          <tns:customsDeclaration>
            <tns:customsDeclarationType/>
            <tns:customsDeclarationText/>
          </tns:customsDeclaration>
        </tns:product>
        <tns:purchaseOrder/>
      </tns:consignment>
    </tns:bookingRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
